[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:12:20
   doLogout,
   currentUrl = window.location.href,
 }) {
-  var oauthLogin = systemInfo?.oauthLogin || '/oauth2/authorization/google';
+  var oauthLogin = true;
 
   return (
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] OptionalChaining
main/components/Nav/AppNavbar.jsx:12:20
   doLogout,
   currentUrl = window.location.href,
 }) {
-  var oauthLogin = systemInfo?.oauthLogin || '/oauth2/authorization/google';
+  var oauthLogin = systemInfo.oauthLogin || '/oauth2/authorization/google';
 
   return (
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Cannot read properties of undefined (reading 'oauthLogin')

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:16:9
 
   return (
     <>
-      {(currentUrl.startsWith('http://localhost:3000') ||
-        currentUrl.startsWith('http://127.0.0.1:3000')) && <AppNavbarLocalhost url={currentUrl} />}
+      {(currentUrl.startsWith('http://localhost:3000') && currentUrl.startsWith('http://127.0.0.1:3000')) && <AppNavbarLocalhost url={currentUrl} />}
 
       <Navbar expand="xl" variant="dark" bg="dark" sticky="top" data-testid="AppNavbar">
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:16:8
 
   return (
     <>
-      {(currentUrl.startsWith('http://localhost:3000') ||
-        currentUrl.startsWith('http://127.0.0.1:3000')) && <AppNavbarLocalhost url={currentUrl} />}
+      {true}
 
       <Navbar expand="xl" variant="dark" bg="dark" sticky="top" data-testid="AppNavbar">
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] MethodExpression
main/components/Nav/AppNavbar.jsx:17:9
   return (
     <>
       {(currentUrl.startsWith('http://localhost:3000') ||
-        currentUrl.startsWith('http://127.0.0.1:3000')) && <AppNavbarLocalhost url={currentUrl} />}
+        currentUrl.endsWith('http://127.0.0.1:3000')) && <AppNavbarLocalhost url={currentUrl} />}
 
       <Navbar expand="xl" variant="dark" bg="dark" sticky="top" data-testid="AppNavbar">
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://127.0.0.1:3000
statusReason: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] StringLiteral
main/components/Nav/AppNavbar.jsx:17:31
   return (
     <>
       {(currentUrl.startsWith('http://localhost:3000') ||
-        currentUrl.startsWith('http://127.0.0.1:3000')) && <AppNavbarLocalhost url={currentUrl} />}
+        currentUrl.startsWith("")) && <AppNavbarLocalhost url={currentUrl} />}
 
       <Navbar expand="xl" variant="dark" bg="dark" sticky="top" data-testid="AppNavbar">
killedBy: AppNavbar tests does NOT render the AppNavbarLocalhost when on localhost:8080
statusReason: Found multiple elements by: [data-testid="/AppNavbarLocalhost/i"]

Here are the matching elements:

Ignored nodes: comments, script, style
<nav
  class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
  data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:44:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, 'ROLE_ADMIN') && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown">
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:44:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, 'ROLE_ADMIN') && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown">
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
