[Killed] BlockStatement
main/layouts/BasicLayout/BasicLayout.jsx:9:51
 
 import { useSystemInfo } from 'main/utils/systemInfo';
 
-export default function BasicLayout({ children }) {
-  const currentUser = useCurrentUser();
-  const { data: systemInfo } = useSystemInfo();
-
-  const doLogout = useLogout().mutate;
-
-  return (
-    <div className="d-flex flex-column min-vh-100">
-      <AppNavbar
-        currentUser={currentUser}
-        systemInfo={systemInfo}
-        doLogout={doLogout}
-      />
-      <Container expand="xl" className="flex-grow-1 pt-4">
-        {children}
-      </Container>
-      <Footer />
-    </div>
-  );
-}
+export default function BasicLayout({ children }) {}
 
killedBy: UCSBDatesIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create UCSBDate/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
