[Killed] BlockStatement
src/main/utils/systemInfo.js:4:33
 import { useQuery } from '@tanstack/react-query';
 import axios from 'axios';
 
-export function useSystemInfo() {
-  return useQuery({
-    queryKey: ['systemInfo'],
-    queryFn: async () => {
-      try {
-        const response = await axios.get('/api/systemInfo');
-        return response.data;
-      } catch (e) {
-        console.error('Error invoking axios.get: ', e);
-        return {};
-      }
-    },
-    initialData: {
-      initialData: true,
-      springH2ConsoleEnabled: true,
-      showSwaggerUILink: true,
-      oauthLogin: '/oauth2/authorization/google',
-      sourceRepo: 'https://github.com/ucsb-cs156-f25/STARTER-team02',
-    },
-  });
-}
+export function useSystemInfo() {}
 
killedBy: UCSBDatesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Cannot destructure property 'data' of '(0 , useSystemInfo)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/systemInfo.js:7:26
 export function useSystemInfo() {
   return useQuery({
     queryKey: ['systemInfo'],
-    queryFn: async () => {
-      try {
-        const response = await axios.get('/api/systemInfo');
-        return response.data;
-      } catch (e) {
-        console.error('Error invoking axios.get: ', e);
-        return {};
-      }
-    },
+    queryFn: async () => {},
     initialData: {
       initialData: true,
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: expected 'Query data cannot be undefined. Pleas…' to match /Error invoking axios.get:/

[Killed] BlockStatement
src/main/utils/systemInfo.js:8:11
   return useQuery({
     queryKey: ['systemInfo'],
     queryFn: async () => {
-      try {
-        const response = await axios.get('/api/systemInfo');
-        return response.data;
-      } catch (e) {
+      try {} catch (e) {
         console.error('Error invoking axios.get: ', e);
         return {};
killedBy: AdminUsersPage tests renders empty table when backend unavailable
statusReason: expected 'Query data cannot be undefined. Pleas…' to match 'Error communicating with backend via …'

[Killed] BlockStatement
src/main/utils/systemInfo.js:11:19
       try {
         const response = await axios.get('/api/systemInfo');
         return response.data;
-      } catch (e) {
-        console.error('Error invoking axios.get: ', e);
-        return {};
-      }
+      } catch (e) {}
     },
     initialData: {
killedBy: Footer tests SystemInfo is returning null renders correctly without system info content
statusReason: expected 'This is a sample webapp using React w…' to be 'This is a sample webapp using React w…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <footer

[Killed] StringLiteral
src/main/utils/systemInfo.js:12:23
         const response = await axios.get('/api/systemInfo');
         return response.data;
       } catch (e) {
-        console.error('Error invoking axios.get: ', e);
+        console.error("", e);
         return {};
       }
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: expected '' to match /Error invoking axios.get:/
