[Killed] StringLiteral
src/main/utils/useCurrentUser.js:6:16
 
 export function useCurrentUser() {
   const queryResults = useQuery({
-    queryKey: ['current user'],
+    queryKey: [""],
     queryFn: async () => {
       try {
killedBy: utils/currentUser tests useCurrentUser should log an error and re-throw on a non-403 error
statusReason: expected undefined to be truthy

[Killed] BlockStatement
src/main/utils/useCurrentUser.js:7:26
 export function useCurrentUser() {
   const queryResults = useQuery({
     queryKey: ['current user'],
-    queryFn: async () => {
-      try {
-        const response = await axios.get('/api/currentUser');
-        if (response.data == null) {
-          return { loggedIn: false, root: {} };
-        }
-        if (!(response.data instanceof Object) || !('roles' in response.data)) {
-          return { loggedIn: false, root: response.data };
-        }
-        let rolesList = response.data.roles.map((r) => r.authority);
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        if (e.status === 403) {
-          return { loggedIn: false, root: {} };
-        } else {
-          console.error('Error invoking axios.get: ', e);
-          throw e;
-        }
-      }
-    },
+    queryFn: async () => {},
     initialData: { loggedIn: false, root: null, initialData: true },
   });
killedBy: UCSBDatesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Unable to find an element with the text: /Welcome/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/utils/useCurrentUser.js:8:11
   const queryResults = useQuery({
     queryKey: ['current user'],
     queryFn: async () => {
-      try {
-        const response = await axios.get('/api/currentUser');
-        if (response.data == null) {
-          return { loggedIn: false, root: {} };
-        }
-        if (!(response.data instanceof Object) || !('roles' in response.data)) {
-          return { loggedIn: false, root: response.data };
-        }
-        let rolesList = response.data.roles.map((r) => r.authority);
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
+      try {} catch (e) {
         if (e.status === 403) {
           return { loggedIn: false, root: {} };
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: false when API returns null
statusReason: expected null to deeply equal {}

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/main/utils/useCurrentUser.js:10:13
     queryFn: async () => {
       try {
         const response = await axios.get('/api/currentUser');
-        if (response.data == null) {
+        if (response.data != null) {
           return { loggedIn: false, root: {} };
         }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Unable to find an element with the text: /Welcome/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Not logged in.
    </p>

[Killed] BlockStatement
src/main/utils/useCurrentUser.js:10:36
     queryFn: async () => {
       try {
         const response = await axios.get('/api/currentUser');
-        if (response.data == null) {
-          return { loggedIn: false, root: {} };
-        }
+        if (response.data == null) {}
         if (!(response.data instanceof Object) || !('roles' in response.data)) {
           return { loggedIn: false, root: response.data };
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: false when API returns null
statusReason: expected null to deeply equal {}

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/main/utils/useCurrentUser.js:13:51
         if (response.data == null) {
           return { loggedIn: false, root: {} };
         }
-        if (!(response.data instanceof Object) || !('roles' in response.data)) {
+        if (!(response.data instanceof Object) || 'roles' in response.data) {
           return { loggedIn: false, root: response.data };
         }
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: true with rolesList for a logged-in user
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/useCurrentUser.js:13:80
         if (response.data == null) {
           return { loggedIn: false, root: {} };
         }
-        if (!(response.data instanceof Object) || !('roles' in response.data)) {
-          return { loggedIn: false, root: response.data };
-        }
+        if (!(response.data instanceof Object) || !('roles' in response.data)) {}
         let rolesList = response.data.roles.map((r) => r.authority);
         response.data = { ...response.data, rolesList: rolesList };
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: false when API returns an object without roles
statusReason: expected null to deeply equal { some: 'data' }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/main/utils/useCurrentUser.js:14:30
           return { loggedIn: false, root: {} };
         }
         if (!(response.data instanceof Object) || !('roles' in response.data)) {
-          return { loggedIn: false, root: response.data };
+          return { loggedIn: true, root: response.data };
         }
         let rolesList = response.data.roles.map((r) => r.authority);
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: false when API returns an object without roles
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/useCurrentUser.js:19:19
         let rolesList = response.data.roles.map((r) => r.authority);
         response.data = { ...response.data, rolesList: rolesList };
         return { loggedIn: true, root: response.data };
-      } catch (e) {
-        if (e.status === 403) {
-          return { loggedIn: false, root: {} };
-        } else {
-          console.error('Error invoking axios.get: ', e);
-          throw e;
-        }
-      }
+      } catch (e) {}
     },
     initialData: { loggedIn: false, root: null, initialData: true },
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: false on a 403 error
statusReason: expected null to deeply equal {}

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/useCurrentUser.js:22:16
       } catch (e) {
         if (e.status === 403) {
           return { loggedIn: false, root: {} };
-        } else {
-          console.error('Error invoking axios.get: ', e);
-          throw e;
-        }
+        } else {}
       }
     },
killedBy: utils/currentUser tests useCurrentUser should log an error and re-throw on a non-403 error
statusReason: expected "error" to be called with arguments: [ 'Error invoking axios.get: ', …(1) ]

Received: 

  1st error call:

  [
-   "Error invoking axios.get: ",
