[Killed] LogicalOperator
main/components/HelpRequests/HelpRequestForm.jsx:28:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + '-id'}
-            id="id"
-            type="text"
-            {...register('id')}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid={testIdPrefix + '-id'} id="id" type="text" {...register('id')} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.jsx:28:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + '-id'}
-            id="id"
-            type="text"
-            {...register('id')}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when the data is changed
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:51:24
           isInvalid={Boolean(errors.requesterEmail)}
           {...register('requesterEmail', {
             required: 'Requester Email is required.',
-            maxLength: {
-              value: 255,
-              message: 'Max length 255 characters',
-            },
+            maxLength: {},
           })}
         />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:68:34
           id="teamId"
           type="text"
           isInvalid={Boolean(errors.teamId)}
-          {...register('teamId', {
-            required: 'Team ID is required.',
-          })}
+          {...register('teamId', {})}
         />
         <Form.Control.Feedback type="invalid">{errors.teamId?.message}</Form.Control.Feedback>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Team ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/HelpRequests/HelpRequestForm.jsx:72:48
             required: 'Team ID is required.',
           })}
         />
-        <Form.Control.Feedback type="invalid">{errors.teamId?.message}</Form.Control.Feedback>
+        <Form.Control.Feedback type="invalid">{errors.teamId.message}</Form.Control.Feedback>
       </Form.Group>
 
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:96:39
           id="requestTime"
           type="datetime-local"
           isInvalid={Boolean(errors.requestTime)}
-          {...register('requestTime', {
-            required: true,
-            pattern: isodate_regex,
-          })}
+          {...register('requestTime', {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Request Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/HelpRequests/HelpRequestForm.jsx:97:23
           type="datetime-local"
           isInvalid={Boolean(errors.requestTime)}
           {...register('requestTime', {
-            required: true,
+            required: false,
             pattern: isodate_regex,
           })}
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Request Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:112:24
           id="explanation"
           type="text"
           isInvalid={Boolean(errors.explanation)}
-          {...register('explanation', {
+          {...register("", {
             required: 'Explanation is required.',
           })}
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/HelpRequests/HelpRequestForm.jsx:116:48
             required: 'Explanation is required.',
           })}
         />
-        <Form.Control.Feedback type="invalid">{errors.explanation?.message}</Form.Control.Feedback>
+        <Form.Control.Feedback type="invalid">{errors.explanation.message}</Form.Control.Feedback>
       </Form.Group>
 
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:121:62
 
       <Form.Group className="mb-3">
         <Form.Label htmlFor="solved">Solved</Form.Label>
-        <Form.Check id="solved" type="checkbox" {...register('solved')} />
+        <Form.Check id="solved" type="checkbox" {...register("")} />
       </Form.Group>
 
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:128:37
       <Button
         variant="Secondary"
         onClick={() => navigate(-1)}
-        data-testid={testIdPrefix + '-cancel'}>
+        data-testid={testIdPrefix + ""}>
         Cancel
       </Button>
killedBy: HelpRequestForm tests that navigate(-1) is called when Cancel is clicked
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-cancel"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
