[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:46:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, 'ROLE_ADMIN') && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown">
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, 'ROLE_ADMIN') || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
+                </NavDropdown>}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
