[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:39:5
       header: 'id',
       accessorKey: 'id', // accessor is the "key" in the data
     },
-    {
-      header: 'Requester Email',
-      accessorKey: 'requesterEmail',
-    },
+    {},
     {
       header: 'Team ID',
killedBy: HelpRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:40:15
       accessorKey: 'id', // accessor is the "key" in the data
     },
     {
-      header: 'Requester Email',
+      header: "",
       accessorKey: 'requesterEmail',
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Requester Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="HelpRequestTable"

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:43:5
       header: 'Requester Email',
       accessorKey: 'requesterEmail',
     },
-    {
-      header: 'Team ID',
-      accessorKey: 'teamId',
-    },
+    {},
     {
       header: 'Table or Breakout Room',
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:44:15
       accessorKey: 'requesterEmail',
     },
     {
-      header: 'Team ID',
+      header: "",
       accessorKey: 'teamId',
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Team ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:45:20
     },
     {
       header: 'Team ID',
-      accessorKey: 'teamId',
+      accessorKey: "",
     },
     {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:49:20
     },
     {
       header: 'Table or Breakout Room',
-      accessorKey: 'tableOrBreakoutRoom',
+      accessorKey: "",
     },
     {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-tableOrBreakoutRoom"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:52:15
       accessorKey: 'tableOrBreakoutRoom',
     },
     {
-      header: 'Request Time (in UTC)',
+      header: "",
       accessorKey: 'requestTime',
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Request Time (in UTC). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:60:15
       accessorKey: 'explanation',
     },
     {
-      header: 'Solved',
+      header: "",
       accessorKey: 'solved',
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Solved. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:66:31
   ];
 
   if (hasRole(currentUser, 'ROLE_ADMIN')) {
-    columns.push(ButtonColumn('Edit', 'primary', editCallback, testIdPrefix));
+    columns.push(ButtonColumn("", 'primary', editCallback, testIdPrefix));
     columns.push(ButtonColumn('Delete', 'danger', deleteCallback, testIdPrefix));
   }
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:67:31
 
   if (hasRole(currentUser, 'ROLE_ADMIN')) {
     columns.push(ButtonColumn('Edit', 'primary', editCallback, testIdPrefix));
-    columns.push(ButtonColumn('Delete', 'danger', deleteCallback, testIdPrefix));
+    columns.push(ButtonColumn("", 'danger', deleteCallback, testIdPrefix));
   }
 
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
