[Killed] ArrowFunction
src/main/components/OurTable.jsx:13:32
 import SortCaret from 'main/components/Common/SortCaret';
 
 function OurTable({ data, columns, testid = 'testid' }) {
-  const memoizedData = useMemo(() => data, [data]);
+  const memoizedData = useMemo(() => undefined, [data]);
   const memoizedColumns = useMemo(() => columns, [columns]);
 
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/main/components/OurTable.jsx:31:38
             data-testid={`${testid}-header-group-${i}`}
             // Stryker disable next-line StringLiteral : React key property not exposed in dom
             key={`${testid}-header-group-${i}`}>
-            {headerGroup.headers.map((header) => (
-              <th
-                data-testid={`${testid}-header-${header.column.id}`}
-                key={`${testid}-header-${header.column.id}`}
-                colSpan={header.colSpan}>
-                {header.isPlaceholder ? null : (
-                  <div
-                    // Add onClick handler for sorting if the column is sortable
-                    {...(header.column.getCanSort() && {
-                      onClick: header.column.getToggleSortingHandler(),
-                      style: { cursor: 'pointer' }, // Add cursor style for visual cue
-                    })}
-                    data-testid={`${testid}-header-${header.column.id}-sort-header`}>
-                    {flexRender(header.column.columnDef.header, header.getContext())}
-                    <SortCaret header={header} testId={testid} />
-                  </div>
-                )}
-              </th>
-            ))}
+            {headerGroup.headers.map(() => undefined)}
           </tr>
         ))}
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="HelpRequestTable"

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:39:26
                 {header.isPlaceholder ? null : (
                   <div
                     // Add onClick handler for sorting if the column is sortable
-                    {...(header.column.getCanSort() && {
-                      onClick: header.column.getToggleSortingHandler(),
-                      style: { cursor: 'pointer' }, // Add cursor style for visual cue
-                    })}
+                    {...(true)}
                     data-testid={`${testid}-header-${header.column.id}-sort-header`}>
                     {flexRender(header.column.columnDef.header, header.getContext())}
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: expect(element).toHaveStyle()

- Expected

- cursor: pointer;

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:39:26
                 {header.isPlaceholder ? null : (
                   <div
                     // Add onClick handler for sorting if the column is sortable
-                    {...(header.column.getCanSort() && {
-                      onClick: header.column.getToggleSortingHandler(),
-                      style: { cursor: 'pointer' }, // Add cursor style for visual cue
-                    })}
+                    {...(false)}
                     data-testid={`${testid}-header-${header.column.id}-sort-header`}>
                     {flexRender(header.column.columnDef.header, header.getContext())}
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: expect(element).toHaveStyle()

- Expected

- cursor: pointer;

[Killed] BlockStatement
src/main/components/OurTable.jsx:54:48
         ))}
       </thead>
       <tbody>
-        {table.getRowModel().rows.map((row) => {
-          const rowTestId = `${testid}-row-${row.index}`;
-          return (
-            <tr
-              data-testid={rowTestId}
-              // Stryker disable next-line StringLiteral : React key property not exposed in dom
-              key={rowTestId}>
-              {row.getVisibleCells().map((cell) => {
-                const testId = `${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`;
-                return (
-                  <td
-                    data-testid={testId}
-                    // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                    key={testId}>
-                    {flexRender(cell.column.columnDef.cell, cell.getContext())}
-                  </td>
-                );
-              })}
-            </tr>
-          );
-        })}
+        {table.getRowModel().rows.map((row) => {})}
       </tbody>
     </table>
killedBy: OurTable tests renders a table with three rows with correct test ids
statusReason: Unable to find an element by: [data-testid="testid-row-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="testid"

[Killed] BlockStatement
src/main/components/OurTable.jsx:61:52
               data-testid={rowTestId}
               // Stryker disable next-line StringLiteral : React key property not exposed in dom
               key={rowTestId}>
-              {row.getVisibleCells().map((cell) => {
-                const testId = `${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`;
-                return (
-                  <td
-                    data-testid={testId}
-                    // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                    key={testId}>
-                    {flexRender(cell.column.columnDef.cell, cell.getContext())}
-                  </td>
-                );
-              })}
+              {row.getVisibleCells().map((cell) => {})}
             </tr>
           );
killedBy: OurTable tests The button appears in the table
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="testid"

[Killed] BlockStatement
src/main/components/OurTable.jsx:82:64
 
 export default OurTable;
 
-export function ButtonColumn(label, variant, callback, testid) {
-  const columnHelper = createColumnHelper();
-
-  const buttonColumn = columnHelper.display({
-    id: label, // Unique ID for display columns
-    header: label,
-    cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}>
-        {label}
-      </Button>
-    ),
-  });
-  return buttonColumn;
-}
+export function ButtonColumn(label, variant, callback, testid) {}
 
killedBy: OurTable tests renders an empty table without crashing
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
src/main/components/OurTable.jsx:85:45
 export function ButtonColumn(label, variant, callback, testid) {
   const columnHelper = createColumnHelper();
 
-  const buttonColumn = columnHelper.display({
-    id: label, // Unique ID for display columns
-    header: label,
-    cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}>
-        {label}
-      </Button>
-    ),
-  });
+  const buttonColumn = columnHelper.display({});
   return buttonColumn;
 }
killedBy: HelpRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Help Requests/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
src/main/components/OurTable.jsx:88:11
   const buttonColumn = columnHelper.display({
     id: label, // Unique ID for display columns
     header: label,
-    cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}>
-        {label}
-      </Button>
-    ),
+    cell: () => undefined,
   });
   return buttonColumn;
killedBy: OurTable tests The button appears in the table
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="testid"
