[Killed] ConditionalExpression
main/components/Restaurants/RestaurantForm.jsx:20:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + '-id'}
-            id="id"
-            type="text"
-            {...register('id')}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.jsx:24:41
         <Form.Group className="mb-3">
           <Form.Label htmlFor="id">Id</Form.Label>
           <Form.Control
-            data-testid={testIdPrefix + '-id'}
+            data-testid={testIdPrefix + ""}
             id="id"
             type="text"
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.jsx:37:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="name">Name</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + '-name'}
+          data-testid={testIdPrefix + ""}
           id="name"
           type="text"
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RestaurantForm-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/components/Restaurants/RestaurantForm.jsx:49:48
             },
           })}
         />
-        <Form.Control.Feedback type="invalid">{errors.name?.message}</Form.Control.Feedback>
+        <Form.Control.Feedback type="invalid">{errors.name.message}</Form.Control.Feedback>
       </Form.Group>
 
killedBy: RestaurantForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/Restaurants/RestaurantForm.jsx:59:39
           id="description"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register('description', {
-            required: 'Description is required.',
-          })}
+          {...register('description', {})}
         />
         <Form.Control.Feedback type="invalid">{errors.description?.message}</Form.Control.Feedback>
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Description is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Restaurants/RestaurantForm.jsx:63:48
             required: 'Description is required.',
           })}
         />
-        <Form.Control.Feedback type="invalid">{errors.description?.message}</Form.Control.Feedback>
+        <Form.Control.Feedback type="invalid">{errors.description.message}</Form.Control.Feedback>
       </Form.Group>
 
killedBy: RestaurantForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')
