[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.jsx:17:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/restaurants/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/restaurants/edit/2' ]

Received: 

  1st spy call:

  [
-   "/restaurants/edit/2",

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.jsx:37:20
   const columns = [
     {
       header: 'id',
-      accessorKey: 'id', // accessor is the "key" in the data
+      accessorKey: "", // accessor is the "key" in the data
     },
 
killedBy: RestaurantTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:

[Killed] ObjectLiteral
main/components/Restaurants/RestaurantTable.jsx:44:5
       header: 'Name',
       accessorKey: 'name',
     },
-    {
-      header: 'Description',
-      accessorKey: 'description',
-    },
+    {},
   ];
 
killedBy: RestaurantTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.jsx:46:20
     },
     {
       header: 'Description',
-      accessorKey: 'description',
+      accessorKey: "",
     },
   ];
killedBy: RestaurantTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-description"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="RestaurantTable"

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.jsx:50:43
     },
   ];
 
-  if (hasRole(currentUser, 'ROLE_ADMIN')) {
-    columns.push(ButtonColumn('Edit', 'primary', editCallback, testIdPrefix));
-    columns.push(ButtonColumn('Delete', 'danger', deleteCallback, testIdPrefix));
-  }
+  if (hasRole(currentUser, 'ROLE_ADMIN')) {}
 
   return <OurTable data={restaurants} columns={columns} testid={testIdPrefix} />;
killedBy: RestaurantTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="RestaurantTable"
