[Killed] LogicalOperator
main/components/UCSBDates/UCSBDateForm.jsx:30:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDateForm-id"
-                id="id"
-                type="text"
-                {...register('id')}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="UCSBDateForm-id" id="id" type="text" {...register('id')} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: UCSBDateForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.jsx:30:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDateForm-id"
-                id="id"
-                type="text"
-                {...register('id')}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: UCSBDatesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBDateForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/components/UCSBDates/UCSBDateForm.jsx:55:27
               type="text"
               isInvalid={Boolean(errors.quarterYYYYQ)}
               {...register('quarterYYYYQ', {
-                required: true,
+                required: false,
                 pattern: yyyyq_regex,
               })}
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /QuarterYYYYQ is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBDates/UCSBDateForm.jsx:61:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.quarterYYYYQ && 'QuarterYYYYQ is required. '}
-              {errors.quarterYYYYQ?.type === 'pattern' &&
+              {errors.quarterYYYYQ.type === 'pattern' &&
                 'QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022'}
             </Form.Control.Feedback>
killedBy: UCSBDateForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] LogicalOperator
main/components/UCSBDates/UCSBDateForm.jsx:61:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.quarterYYYYQ && 'QuarterYYYYQ is required. '}
-              {errors.quarterYYYYQ?.type === 'pattern' &&
-                'QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022'}
+              {errors.quarterYYYYQ?.type === 'pattern' || 'QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022'}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDateForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /QuarterYYYYQ must be in the format YYYYQ/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBDates/UCSBDateForm.jsx:62:17
             <Form.Control.Feedback type="invalid">
               {errors.quarterYYYYQ && 'QuarterYYYYQ is required. '}
               {errors.quarterYYYYQ?.type === 'pattern' &&
-                'QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022'}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDateForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /QuarterYYYYQ must be in the format YYYYQ/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBDates/UCSBDateForm.jsx:75:27
               type="datetime-local"
               isInvalid={Boolean(errors.localDateTime)}
               {...register('localDateTime', {
-                required: true,
+                required: false,
                 pattern: isodate_regex,
               })}
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /LocalDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBDates/UCSBDateForm.jsx:96:27
               type="text"
               isInvalid={Boolean(errors.name)}
               {...register('name', {
-                required: 'Name is required.',
+                required: "",
               })}
             />
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
