[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:32:15
 
   const columns = [
     {
-      header: 'id',
+      header: "",
       accessorKey: 'id', // accessor is the "key" in the data
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="UCSBDatesTable"

[Killed] ObjectLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:35:5
       header: 'id',
       accessorKey: 'id', // accessor is the "key" in the data
     },
-    {
-      header: 'QuarterYYYYQ',
-      accessorKey: 'quarterYYYYQ',
-    },
+    {},
     {
       header: 'Name',
killedBy: UCSBDatesIndexPage tests Renders with Create Button for admin user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:36:15
       accessorKey: 'id', // accessor is the "key" in the data
     },
     {
-      header: 'QuarterYYYYQ',
+      header: "",
       accessorKey: 'quarterYYYYQ',
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: QuarterYYYYQ. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="UCSBDatesTable"

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:37:20
     },
     {
       header: 'QuarterYYYYQ',
-      accessorKey: 'quarterYYYYQ',
+      accessorKey: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-quarterYYYYQ"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="UCSBDatesTable"

[Killed] ObjectLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:39:5
       header: 'QuarterYYYYQ',
       accessorKey: 'quarterYYYYQ',
     },
-    {
-      header: 'Name',
-      accessorKey: 'name',
-    },
+    {},
     {
       header: 'Date',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:45:20
     },
     {
       header: 'Date',
-      accessorKey: 'localDateTime',
+      accessorKey: "",
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-localDateTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="UCSBDatesTable"

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:50:64
   ];
 
   if (hasRole(currentUser, 'ROLE_ADMIN')) {
-    columns.push(ButtonColumn('Edit', 'primary', editCallback, 'UCSBDatesTable'));
+    columns.push(ButtonColumn('Edit', 'primary', editCallback, ""));
     columns.push(ButtonColumn('Delete', 'danger', deleteCallback, 'UCSBDatesTable'));
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="UCSBDatesTable"

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:51:67
 
   if (hasRole(currentUser, 'ROLE_ADMIN')) {
     columns.push(ButtonColumn('Edit', 'primary', editCallback, 'UCSBDatesTable'));
-    columns.push(ButtonColumn('Delete', 'danger', deleteCallback, 'UCSBDatesTable'));
+    columns.push(ButtonColumn('Delete', 'danger', deleteCallback, ""));
   }
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="UCSBDatesTable"

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.jsx:51:41
 
   if (hasRole(currentUser, 'ROLE_ADMIN')) {
     columns.push(ButtonColumn('Edit', 'primary', editCallback, 'UCSBDatesTable'));
-    columns.push(ButtonColumn('Delete', 'danger', deleteCallback, 'UCSBDatesTable'));
+    columns.push(ButtonColumn('Delete', "", deleteCallback, 'UCSBDatesTable'));
   }
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
