[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestsCreatePage.jsx:8:31
 import { toast } from 'react-toastify';
 
 export default function HelpRequestsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: '/api/helprequests/post',
-    method: 'POST',
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestsCreatePage.jsx:8:49
 import { toast } from 'react-toastify';
 
 export default function HelpRequestsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: '/api/helprequests/post',
-    method: 'POST',
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = (helpRequest) => ({});
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsCreatePage.jsx:10:13
 export default function HelpRequestsCreatePage({ storybook = false }) {
   const objectToAxiosParams = (helpRequest) => ({
     url: '/api/helprequests/post',
-    method: 'POST',
+    method: "",
     params: {
       requesterEmail: helpRequest.requesterEmail,
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestsCreatePage.jsx:11:13
   const objectToAxiosParams = (helpRequest) => ({
     url: '/api/helprequests/post',
     method: 'POST',
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
+    params: {},
   });
 
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected {} to deeply equal { …(6) }

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsCreatePage.jsx:21:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New Help Request Created - id: ${helpRequest.id} requester email: ${helpRequest.requesterEmail}`
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsCreatePage.jsx:23:7
 
   const onSuccess = (helpRequest) => {
     toast(
-      `New Help Request Created - id: ${helpRequest.id} requester email: ${helpRequest.requesterEmail}`
+      ``
     );
   };
killedBy: HelpRequestsCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New Help Request Created - id: 7 requester email: vnarasiman@ucsb.edu",
