[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestsEditPage.jsx:28:34
     }
   );
 
-  const objectToAxiosPutParams = (helpRequest) => ({
-    url: '/api/helprequests',
-    method: 'PUT',
-    params: {
-      id: helpRequest.id,
-    },
-    data: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when the data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "HelpRequest Updated - id: 17 requester email: vnarasiman@umail.ucsb.edu",

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (helpRequest) => ({
-    url: '/api/helprequests',
+    url: "",
     method: 'PUT',
     params: {
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when the data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "HelpRequest Updated - id: 17 requester email: vnarasiman@umail.ucsb.edu",

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsEditPage.jsx:30:13
 
   const objectToAxiosPutParams = (helpRequest) => ({
     url: '/api/helprequests',
-    method: 'PUT',
+    method: "",
     params: {
       id: helpRequest.id,
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when the data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "HelpRequest Updated - id: 17 requester email: vnarasiman@umail.ucsb.edu",

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsEditPage.jsx:44:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `HelpRequest Updated - id: ${helpRequest.id} requester email: ${helpRequest.requesterEmail}`
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when the data is changed
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsEditPage.jsx:46:7
 
   const onSuccess = (helpRequest) => {
     toast(
-      `HelpRequest Updated - id: ${helpRequest.id} requester email: ${helpRequest.requesterEmail}`
+      ``
     );
   };
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when the data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "HelpRequest Updated - id: 17 requester email: vnarasiman@umail.ucsb.edu",

[Killed] ConditionalExpression
main/pages/HelpRequests/HelpRequestsEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit HelpRequest</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            buttonLabel={'Update'}
-            initialContents={helpRequest}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when the data is changed
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/HelpRequests/HelpRequestsEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit HelpRequest</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            buttonLabel={'Update'}
-            initialContents={helpRequest}
-          />
-        )}
+        {helpRequest || <HelpRequestForm submitAction={onSubmit} buttonLabel={'Update'} initialContents={helpRequest} />}
       </div>
     </BasicLayout>
killedBy: HelpRequestsEditPage tests tests where backend is working normally Is populated with the data provided, and changes when the data is changed
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
