[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestsIndexPage.jsx:19:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ['/api/helprequests/all'],
-    { method: 'GET', url: '/api/helprequests/all' },
+    { method: 'GET', url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     []
killedBy: HelpRequestsIndexPage tests renders three helprequests correctly for regular user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsIndexPage.jsx:24:30
     []
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, 'ROLE_ADMIN')) {
-      return (
-        <Button variant="primary" href="/helprequests/create" style={{ float: 'right' }}>
-          Create Help Requests
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: HelpRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Help Requests/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestsIndexPage.jsx:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, 'ROLE_ADMIN')) {
-      return (
-        <Button variant="primary" href="/helprequests/create" style={{ float: 'right' }}>
-          Create Help Requests
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, 'ROLE_ADMIN')) {}
   };
 
killedBy: HelpRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Help Requests/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
