[Killed] ArrowFunction
main/pages/Restaurants/RestaurantCreatePage.jsx:8:31
 import { toast } from 'react-toastify';
 
 export default function RestaurantCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (restaurant) => ({
-    url: '/api/restaurants/post',
-    method: 'POST',
-    params: {
-      name: restaurant.name,
-      description: restaurant.description,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.jsx:17:37
     },
   });
 
-  const onSuccess = (restaurant) => {
-    toast(`New restaurant Created - id: ${restaurant.id} name: ${restaurant.name}`);
-  };
+  const onSuccess = (restaurant) => {};
 
   const mutation = useBackendMutation(
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
