[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/restaurants?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: 'GET',
-      url: `/api/restaurants`,
-      params: {
-        id,
-      },
-    }
+    {}
   );
 
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Restaurants/RestaurantEditPage.jsx:28:34
     }
   );
 
-  const objectToAxiosPutParams = (restaurant) => ({
-    url: '/api/restaurants',
-    method: 'PUT',
-    params: {
-      id: restaurant.id,
-    },
-    data: {
-      name: restaurant.name,
-      description: restaurant.description,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Restaurant Updated - id: 17 name: Freebirds World Burrito",

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.jsx:28:51
     }
   );
 
-  const objectToAxiosPutParams = (restaurant) => ({
-    url: '/api/restaurants',
-    method: 'PUT',
-    params: {
-      id: restaurant.id,
-    },
-    data: {
-      name: restaurant.name,
-      description: restaurant.description,
-    },
-  });
+  const objectToAxiosPutParams = (restaurant) => ({});
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Restaurant Updated - id: 17 name: Freebirds World Burrito",

[Killed] StringLiteral
main/pages/Restaurants/RestaurantEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (restaurant) => ({
-    url: '/api/restaurants',
+    url: "",
     method: 'PUT',
     params: {
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Restaurant Updated - id: 17 name: Freebirds World Burrito",

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.jsx:31:13
   const objectToAxiosPutParams = (restaurant) => ({
     url: '/api/restaurants',
     method: 'PUT',
-    params: {
-      id: restaurant.id,
-    },
+    params: {},
     data: {
       name: restaurant.name,
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected {} to deeply equal { id: 17 }

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.jsx:65:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
-        {restaurant && (
-          <RestaurantForm
-            submitAction={onSubmit}
-            buttonLabel={'Update'}
-            initialContents={restaurant}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.jsx:65:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
-        {restaurant && (
-          <RestaurantForm
-            submitAction={onSubmit}
-            buttonLabel={'Update'}
-            initialContents={restaurant}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
