[Killed] StringLiteral
main/pages/Restaurants/RestaurantIndexPage.jsx:19:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ['/api/restaurants/all'],
-    { method: 'GET', url: '/api/restaurants/all' },
+    { method: "", url: '/api/restaurants/all' },
     // Stryker disable next-line all : don't test default value of empty list
     []
killedBy: RestaurantIndexPage tests renders empty table when backend unavailable, user only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantIndexPage.jsx:19:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ['/api/restaurants/all'],
-    { method: 'GET', url: '/api/restaurants/all' },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     []
killedBy: RestaurantIndexPage tests renders three restaurants correctly for regular user
statusReason: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.jsx:24:30
     []
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, 'ROLE_ADMIN')) {
-      return (
-        <Button variant="primary" href="/restaurants/create" style={{ float: 'right' }}>
-          Create Restaurant
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Restaurant/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.jsx:25:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, 'ROLE_ADMIN')) {
-      return (
-        <Button variant="primary" href="/restaurants/create" style={{ float: 'right' }}>
-          Create Restaurant
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, 'ROLE_ADMIN')) {}
   };
 
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Restaurant/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Restaurants/RestaurantIndexPage.jsx:27:78
   const createButton = () => {
     if (hasRole(currentUser, 'ROLE_ADMIN')) {
       return (
-        <Button variant="primary" href="/restaurants/create" style={{ float: 'right' }}>
+        <Button variant="primary" href="/restaurants/create" style={{ float: "" }}>
           Create Restaurant
         </Button>
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
