[Killed] ArrowFunction
main/pages/UCSBDates/UCSBDatesCreatePage.jsx:8:31
 import { toast } from 'react-toastify';
 
 export default function UCSBDatesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsbDate) => ({
-    url: '/api/ucsbdates/post',
-    method: 'POST',
-    params: {
-      quarterYYYYQ: ucsbDate.quarterYYYYQ,
-      name: ucsbDate.name,
-      localDateTime: ucsbDate.localDateTime,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbDate) => {
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesCreatePage.jsx:8:46
 import { toast } from 'react-toastify';
 
 export default function UCSBDatesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsbDate) => ({
-    url: '/api/ucsbdates/post',
-    method: 'POST',
-    params: {
-      quarterYYYYQ: ucsbDate.quarterYYYYQ,
-      name: ucsbDate.name,
-      localDateTime: ucsbDate.localDateTime,
-    },
-  });
+  const objectToAxiosParams = (ucsbDate) => ({});
 
   const onSuccess = (ucsbDate) => {
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/UCSBDates/UCSBDatesCreatePage.jsx:10:13
 export default function UCSBDatesCreatePage({ storybook = false }) {
   const objectToAxiosParams = (ucsbDate) => ({
     url: '/api/ucsbdates/post',
-    method: 'POST',
+    method: "",
     params: {
       quarterYYYYQ: ucsbDate.quarterYYYYQ,
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
