[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsbdates?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: 'GET',
-      url: `/api/ucsbdates`,
-      params: {
-        id,
-      },
-    }
+    {}
   );
 
killedBy: UCSBDatesEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBDates/UCSBDatesEditPage.jsx:28:34
     }
   );
 
-  const objectToAxiosPutParams = (ucsbDate) => ({
-    url: '/api/ucsbdates',
-    method: 'PUT',
-    params: {
-      id: ucsbDate.id,
-    },
-    data: {
-      quarterYYYYQ: ucsbDate.quarterYYYYQ,
-      name: ucsbDate.name,
-      localDateTime: ucsbDate.localDateTime,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbDate) => {
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBDate Updated - id: 17 name: Christmas Morning",

[Killed] ObjectLiteral
main/pages/UCSBDates/UCSBDatesEditPage.jsx:31:13
   const objectToAxiosPutParams = (ucsbDate) => ({
     url: '/api/ucsbdates',
     method: 'PUT',
-    params: {
-      id: ucsbDate.id,
-    },
+    params: {},
     data: {
       quarterYYYYQ: ucsbDate.quarterYYYYQ,
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected {} to deeply equal { id: 17 }

[Killed] LogicalOperator
main/pages/UCSBDates/UCSBDatesEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
-        {ucsbDate && (
-          <UCSBDateForm initialContents={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />
-        )}
+        {ucsbDate || <UCSBDateForm initialContents={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: UCSBDatesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="UCSBDateForm-quarterYYYYQ"
  id="quarterYYYYQ"
  name="quarterYYYYQ"
  type="text"

[Killed] ConditionalExpression
main/pages/UCSBDates/UCSBDatesEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
-        {ucsbDate && (
-          <UCSBDateForm initialContents={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBDatesEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
