[Killed] BooleanLiteral
src/main/utils/useBackend.js:28:85
 //     []
 // );
 
-export function useBackend(queryKey, axiosParameters, initialData, suppressToasts = false) {
+export function useBackend(queryKey, axiosParameters, initialData, suppressToasts = true) {
   return useQuery({
     queryKey: queryKey,
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/main/utils/useBackend.js:28:92
 //     []
 // );
 
-export function useBackend(queryKey, axiosParameters, initialData, suppressToasts = false) {
-  return useQuery({
-    queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
-          toast(errorMessage);
-        }
-        console.error(errorMessage, e);
-        throw e;
-      }
-    },
-    initialData: initialData,
-  });
-}
+export function useBackend(queryKey, axiosParameters, initialData, suppressToasts = false) {}
 
 const wrappedParams = async (params) => {
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Cannot read properties of undefined (reading 'isError')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/useBackend.js:37:30
         return response.data;
       } catch (e) {
         const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
-          toast(errorMessage);
-        }
+        if (!suppressToasts) {}
         console.error(errorMessage, e);
         throw e;
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/main/utils/useBackend.js:54:93
   ).data;
 };
 
-export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey = null) {
-  const queryClient = useQueryClient();
-
-  return useMutation({
-    mutationFn: (object) => wrappedParams(objectToAxiosParams(object)),
-    onError: (data) => {
-      toast(`${data}`);
-    },
-    // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) queryClient.invalidateQueries({ queryKey: queryKey });
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
-}
+export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey = null) {}
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: Cannot read properties of undefined (reading 'mutate')

[Killed] ObjectLiteral
src/main/utils/useBackend.js:57:22
 export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey = null) {
   const queryClient = useQueryClient();
 
-  return useMutation({
-    mutationFn: (object) => wrappedParams(objectToAxiosParams(object)),
-    onError: (data) => {
-      toast(`${data}`);
-    },
-    // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) queryClient.invalidateQueries({ queryKey: queryKey });
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
+  return useMutation({});
 }
 
killedBy: RestaurantTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table
