[Killed] BlockStatement
main/components/Common/SortCaret.jsx:3:66
 import { getSortCaret } from 'main/utils/sortCaretUtils';
 
-export default function SortCaret({ header, testId = 'testid' }) {
-  return (
-    <span data-testid={`${testId}-header-${header.column.id}-sort-carets`}>
-      {getSortCaret(header)}
-    </span>
-  );
-}
+export default function SortCaret({ header, testId = 'testid' }) {}
 
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element by: [data-testid="sampleTestId-header-col1-sort-carets"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="sampleTestId"
