[Killed] BlockStatement
main/components/Nav/Footer.jsx:4:34
 import { Container } from 'react-bootstrap';
 import { useSystemInfo } from 'main/utils/systemInfo';
 
-export default function Footer() {
-  const { data: systemInfo } = useSystemInfo();
-  return (
-    <footer className="bg-light pt-md-4 pb-md-5 pb-4 pt-3" data-testid="Footer">
-      <Container>
-        <p>
-          This is a sample webapp using React with a Spring Boot backend.
-          {systemInfo.sourceRepo ? (
-            <span data-testid="footer-see-source-code">
-              {' '}
-              See the source code on{' '}
-              <a href={`${systemInfo.sourceRepo}`} target="_blank" rel="noopener noreferrer">
-                Github.
-              </a>
-            </span>
-          ) : (
-            <span data-testid="footer-see-source-code" />
-          )}
-        </p>
-      </Container>
-    </footer>
-  );
-}
+export default function Footer() {}
 
killedBy: Footer tests SystemInfo returns content renders correctly with system info content
statusReason: Unable to find an element by: [data-testid="footer-see-source-code"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Nav/Footer.jsx:13:16
           This is a sample webapp using React with a Spring Boot backend.
           {systemInfo.sourceRepo ? (
             <span data-testid="footer-see-source-code">
-              {' '}
+              {""}
               See the source code on{' '}
               <a href={`${systemInfo.sourceRepo}`} target="_blank" rel="noopener noreferrer">
killedBy: Footer tests SystemInfo returns content renders correctly with system info content
statusReason: expected 'This is a sample webapp using React w…' to be 'This is a sample webapp using React w…' // Object.is equality
