[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:8:3
     header: 'id',
     accessorKey: 'id', // accessor is the "key" in the data
   },
-  {
-    header: 'First Name',
-    accessorKey: 'givenName',
-  },
+  {},
   {
     header: 'Last Name',
killedBy: UserTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:12:3
     header: 'First Name',
     accessorKey: 'givenName',
   },
-  {
-    header: 'Last Name',
-    accessorKey: 'familyName',
-  },
+  {},
   {
     header: 'Email',
killedBy: UserTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:16:3
     header: 'Last Name',
     accessorKey: 'familyName',
   },
-  {
-    header: 'Email',
-    accessorKey: 'email',
-  },
+  {},
   {
     header: 'Admin',
killedBy: UserTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:17:13
     accessorKey: 'familyName',
   },
   {
-    header: 'Email',
+    header: "",
     accessorKey: 'email',
   },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="UsersTable"

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:18:18
   },
   {
     header: 'Email',
-    accessorKey: 'email',
+    accessorKey: "",
   },
   {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="UsersTable"

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:20:3
     header: 'Email',
     accessorKey: 'email',
   },
-  {
-    header: 'Admin',
-    id: 'admin',
-    accessorKey: 'admin',
-    cell: ({ cell }) => {
-      return String(cell.getValue());
-    }, // convert boolean to string for display
-  },
+  {},
 ];
 
killedBy: UserTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:22:9
   },
   {
     header: 'Admin',
-    id: 'admin',
+    id: "",
     accessorKey: 'admin',
     cell: ({ cell }) => {
killedBy: UserTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:24:25
     header: 'Admin',
     id: 'admin',
     accessorKey: 'admin',
-    cell: ({ cell }) => {
-      return String(cell.getValue());
-    }, // convert boolean to string for display
+    cell: ({ cell }) => {}, // convert boolean to string for display
   },
 ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:30:47
   },
 ];
 
-export default function UsersTable({ users }) {
-  return <OurTable data={users} columns={columns} testid={'UsersTable'} />;
-}
+export default function UsersTable({ users }) {}
 
killedBy: UserTable tests renders without crashing for empty table
statusReason: Unable to find an element by: [data-testid="UsersTable"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
