[Killed] BlockStatement
src/main/pages/HomePage.jsx:3:36
 import BasicLayout from 'main/layouts/BasicLayout/BasicLayout';
 
-export default function HomePage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Hello, world!</h1>
-        <p>This is a webapp containing a bunch of different Spring Boot/React examples.</p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function HomePage() {}
 
killedBy: HomePage tests renders without crashing
statusReason: Unable to find an element with the text: /Hello, world!/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
