[Killed] StringLiteral
src/main/pages/ProfilePage.jsx:30:28
           <p className="lead text-muted">{email}</p>
           <RoleBadge role={'ROLE_USER'} currentUser={currentUser} />
           <RoleBadge role={'ROLE_MEMBER'} currentUser={currentUser} />
-          <RoleBadge role={'ROLE_ADMIN'} currentUser={currentUser} />
+          <RoleBadge role={""} currentUser={currentUser} />
         </Col>
       </Row>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="role-badge-admin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
