[Killed] BlockStatement
src/main/utils/UCSBDateUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: '/api/ucsbdates',
-    method: 'DELETE',
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBDatesIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'UCSBDate with id 1 was deleted' ]

Received: 

  1st spy call:

  [
-   "UCSBDate with id 1 was deleted",

[Killed] StringLiteral
src/main/utils/UCSBDateUtils.js:10:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: '/api/ucsbdates',
+    url: "",
     method: 'DELETE',
     params: {
killedBy: UCSBDatesIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'UCSBDate with id 1 was deleted' ]

Received: 

  1st spy call:

  [
-   "UCSBDate with id 1 was deleted",
