[Killed] BlockStatement
src/main/utils/helpRequestUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: '/api/helprequests',
-    method: 'DELETE',
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: HelpRequestsIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'HelpRequest with id 1 was deleted' ]

Received: 

  1st spy call:

  [
-   "HelpRequest with id 1 was deleted",
