[Killed] BlockStatement
src/main/utils/restaurantUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: '/api/restaurants',
-    method: 'DELETE',
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Restaurant with id 1 was deleted' ]

Received: 

  1st spy call:

  [
-   "Restaurant with id 1 was deleted",

[Killed] ObjectLiteral
src/main/utils/restaurantUtils.js:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: '/api/restaurants',
-    method: 'DELETE',
-    params: {
-      id: cell.row.original.id,
-    },
-  };
+  return {};
 }
 
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Restaurant with id 1 was deleted' ]

Received: 

  1st spy call:

  [
-   "Restaurant with id 1 was deleted",

[Killed] StringLiteral
src/main/utils/restaurantUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: '/api/restaurants',
-    method: 'DELETE',
+    method: "",
     params: {
       id: cell.row.original.id,
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Restaurant with id 1 was deleted' ]

Received: 

  1st spy call:

  [
-   "Restaurant with id 1 was deleted",
