[Killed] BlockStatement
src/main/utils/sortCaretUtils.js:1:38
-export function getSortCaret(header) {
-  if (!header.column.getCanSort()) return '';
-  if (header.column.getIsSorted() === 'asc') {
-    return '🔼';
-  }
-  if (header.column.getIsSorted() === 'desc') {
-    return '🔽';
-  }
-  return '';
-}
+export function getSortCaret(header) {}
 
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: /🔼/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="sampleTestId"

[Killed] ConditionalExpression
src/main/utils/sortCaretUtils.js:2:7
 export function getSortCaret(header) {
-  if (!header.column.getCanSort()) return '';
+  if (true) return '';
   if (header.column.getIsSorted() === 'asc') {
     return '🔼';
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: /🔼/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="sampleTestId"

[Killed] BooleanLiteral
src/main/utils/sortCaretUtils.js:2:7
 export function getSortCaret(header) {
-  if (!header.column.getCanSort()) return '';
+  if (header.column.getCanSort()) return '';
   if (header.column.getIsSorted() === 'asc') {
     return '🔼';
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: /🔼/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="sampleTestId"

[Killed] BlockStatement
src/main/utils/sortCaretUtils.js:3:46
 export function getSortCaret(header) {
   if (!header.column.getCanSort()) return '';
-  if (header.column.getIsSorted() === 'asc') {
-    return '🔼';
-  }
+  if (header.column.getIsSorted() === 'asc') {}
   if (header.column.getIsSorted() === 'desc') {
     return '🔽';
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: /🔼/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="sampleTestId"

[Killed] ConditionalExpression
src/main/utils/sortCaretUtils.js:3:7
 export function getSortCaret(header) {
   if (!header.column.getCanSort()) return '';
-  if (header.column.getIsSorted() === 'asc') {
+  if (false) {
     return '🔼';
   }
killedBy: SortCaret tests Up arrow when sorted asc
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  🔼
Received:

[Killed] EqualityOperator
src/main/utils/sortCaretUtils.js:6:7
   if (header.column.getIsSorted() === 'asc') {
     return '🔼';
   }
-  if (header.column.getIsSorted() === 'desc') {
+  if (header.column.getIsSorted() !== 'desc') {
     return '🔽';
   }
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  🔽

[Killed] BlockStatement
src/main/utils/sortCaretUtils.js:6:47
   if (header.column.getIsSorted() === 'asc') {
     return '🔼';
   }
-  if (header.column.getIsSorted() === 'desc') {
-    return '🔽';
-  }
+  if (header.column.getIsSorted() === 'desc') {}
   return '';
 }
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: /🔽/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="sampleTestId"

[Killed] StringLiteral
src/main/utils/sortCaretUtils.js:7:12
     return '🔼';
   }
   if (header.column.getIsSorted() === 'desc') {
-    return '🔽';
+    return ""
   }
   return '';
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: /🔽/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-striped table-bordered table"
      data-testid="sampleTestId"
