[Killed] BlockStatement
src/main/utils/useLogout.js:5:29
 import axios from 'axios';
 import { useNavigate } from 'react-router';
 
-export function useLogout() {
-  const queryClient = useQueryClient();
-  const navigate = useNavigate();
-  const mutation = useMutation({
-    mutationFn: async () => {
-      await axios.post('/logout');
-      await queryClient.resetQueries({ queryKey: ['current user'] });
-      navigate('/');
-    },
-  });
-  return mutation;
-}
+export function useLogout() {}
 
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Unable to find an element with the text: /Welcome/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/main/utils/useLogout.js:9:29
   const queryClient = useQueryClient();
   const navigate = useNavigate();
   const mutation = useMutation({
-    mutationFn: async () => {
-      await axios.post('/logout');
-      await queryClient.resetQueries({ queryKey: ['current user'] });
-      navigate('/');
-    },
+    mutationFn: async () => {},
   });
   return mutation;
killedBy: useLogout tests should log out the user, reset queries, and navigate to home
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/main/utils/useLogout.js:11:51
   const mutation = useMutation({
     mutationFn: async () => {
       await axios.post('/logout');
-      await queryClient.resetQueries({ queryKey: ['current user'] });
+      await queryClient.resetQueries({ queryKey: [""] });
       navigate('/');
     },
killedBy: useLogout tests should log out the user, reset queries, and navigate to home
statusReason: expected "resetQueries" to be called with arguments: [ { queryKey: [ 'current user' ] } ]

Received: 

  1st resetQueries call:

  [
    {

[Killed] ArrayDeclaration
src/main/utils/useLogout.js:11:50
   const mutation = useMutation({
     mutationFn: async () => {
       await axios.post('/logout');
-      await queryClient.resetQueries({ queryKey: ['current user'] });
+      await queryClient.resetQueries({ queryKey: [] });
       navigate('/');
     },
killedBy: useLogout tests should log out the user, reset queries, and navigate to home
statusReason: expected "resetQueries" to be called with arguments: [ { queryKey: [ 'current user' ] } ]

Received: 

  1st resetQueries call:

  [
    {
