[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:125:34
           id="solved"
           type="checkbox"
           isInvalid={Boolean(errors.solved)}
-          {...register('solved', {
-            required: 'Solved is required.',
-          })}
+          {...register('solved', {})}
         />
         <Form.Control.Feedback type="invalid">{errors.solved?.message}</Form.Control.Feedback>
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Solved is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/HelpRequests/HelpRequestForm.jsx:129:48
             required: 'Solved is required.',
           })}
         />
-        <Form.Control.Feedback type="invalid">{errors.solved?.message}</Form.Control.Feedback>
+        <Form.Control.Feedback type="invalid">{errors.solved.message}</Form.Control.Feedback>
       </Form.Group>
 
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')
