[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsborganization) => ({
-    url: "/api/ucsborganization",
-    method: "PUT",
-    params: {
-      id: ucsborganization.id,
-    },
-    data: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBOrganization Updated - id: 17 orgCode: ZPR1",

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.jsx:34:11
     params: {
       id: ucsborganization.id,
     },
-    data: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
+    data: {},
   });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected '{}' to be '{"orgCode":"ZPR1","orgTranslationShor…' // Object.is equality

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.jsx:42:43
     },
   });
 
-  const onSuccess = (ucsborganization) => {
-    toast(
-      `UCSBOrganization Updated - id: ${ucsborganization.id} orgCode: ${ucsborganization.orgCode}`,
-    );
-  };
+  const onSuccess = (ucsborganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.jsx:44:7
 
   const onSuccess = (ucsborganization) => {
     toast(
-      `UCSBOrganization Updated - id: ${ucsborganization.id} orgCode: ${ucsborganization.orgCode}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBOrganization Updated - id: 17 orgCode: ZPR1",

[Killed] LogicalOperator
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
-        {ucsborganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsborganization}
-          />
-        )}
+        {ucsborganization || <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsborganization} />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided, and changes when data is changed
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
