[Killed] BlockStatement
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsborganizations/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/ucsborganizations/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsborganizations/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/ucsborganizations/edit/1' ]

Received: 

  1st spy call:

  [
-   "/ucsborganizations/edit/1",

[Killed] ArrayDeclaration
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:37:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "id",
-      accessorKey: "id", // accessor is the "key" in the data
-    },
-
-    {
-      header: "OrgCode",
-      accessorKey: "orgCode",
-    },
-    {
-      header: "OrgTranslationShort",
-      accessorKey: "orgTranslationShort",
-    },
-    {
-      header: "OrgTranslation",
-      accessorKey: "orgTranslation",
-    },
-    {
-      header: "Inactive",
-      accessorKey: "inactive",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.jsx:49:20
     },
     {
       header: "OrgTranslationShort",
-      accessorKey: "orgTranslationShort",
+      accessorKey: "",
     },
     {
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgTranslationShort"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"
