[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function UCSBOrganizationCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (ucsborganization) => ({
-    url: "/api/ucsborganization/post",
-    method: "POST",
-    params: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      // inactive: ucsborganization.inactive === "true"
-      // inactive: ucsborganization.inactive
-      inactive: JSON.parse(ucsborganization.inactive.toLowerCase()),
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationCreatePage.jsx:9:10
 
 export default function UCSBOrganizationCreatePage({ storybook = false }) {
   const objectToAxiosParams = (ucsborganization) => ({
-    url: "/api/ucsborganization/post",
+    url: "",
     method: "POST",
     params: {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New UCSB Organization Created - id: 1 OrgCode: ZPR",

[Killed] MethodExpression
main/pages/UCSBOrganizations/UCSBOrganizationCreatePage.jsx:17:28
       orgTranslation: ucsborganization.orgTranslation,
       // inactive: ucsborganization.inactive === "true"
       // inactive: ucsborganization.inactive
-      inactive: JSON.parse(ucsborganization.inactive.toLowerCase()),
+      inactive: JSON.parse(ucsborganization.inactive.toUpperCase()),
     },
   });
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationCreatePage.jsx:21:43
     },
   });
 
-  const onSuccess = (ucsborganization) => {
-    toast(
-      `New UCSB Organization Created - id: ${ucsborganization.id} OrgCode: ${ucsborganization.orgCode}`,
-    );
-  };
+  const onSuccess = (ucsborganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
